<?php


namespace App\Services;

class LatinToCyrillic
{
    public function LatinToCyrillic(string $latinString): array|string
    {
        $cyr = [
            'ч', 'ш', 'щ', 'я', 'ц', 'ё', 'ғ', 'ю', 'ў', 'а', 'б', 'в', 'г', 'д', 'е', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п',
            'р', 'с', 'т', 'у', 'ф', 'х', 'ъ', 'ы', 'ь', 'э', 'ж', 'қ', 'х',
            'Ч', 'Ш', 'Щ', 'Я', 'Ц', 'Ё', 'Ғ', 'Ю', 'Ў', 'А', 'Б', 'В', 'Г', 'Д', 'Е', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П',
            'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ъ', 'Ы', 'Ь', 'Э', 'Ж', 'Қ', 'Х'
        ];
        $lat = [
            'ch', 'sh', 'sh', 'ya', 'ts', 'yo', "g'", 'yu', "o'", 'a', 'b', 'v', 'g', 'd', 'e', 'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p',
            'r', 's', 't', 'u', 'f', 'h', 'a', 'i', 'y', 'e', 'j', 'q', 'x',
            'Ch', 'Sh', 'Sh', 'Ya', 'Ts', 'Yo', "G'", 'Yu', "O'", 'A', 'B', 'V', 'G', 'D', 'E', 'Z', 'I', 'Y', 'K', 'L', 'M', 'N', 'O', 'P',
            'R', 'S', 'T', 'U', 'F', 'H', 'A', 'I', 'Y', 'e', 'J', 'Q', 'X'
        ];
        return str_replace($lat, $cyr, $latinString);
    }

    public function CyrillicToLatin($cyrillicString): array|string
    {
        $cyr = [
            'ч', 'ш', 'щ', 'я', 'ц', 'ё', 'ғ', 'ю', 'ў', 'а', 'б', 'в', 'г', 'д', 'е', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п',
            'р', 'с', 'т', 'у', 'ф', 'х', 'ъ', 'ы', 'ь', 'э', 'ж', 'қ', 'х',
            'Ч', 'Ш', 'Щ', 'Я', 'Ц', 'Ё', 'Ғ', 'Ю', 'Ў', 'А', 'Б', 'В', 'Г', 'Д', 'Е', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П',
            'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ъ', 'Ы', 'Ь', 'Э', 'Ж', 'Қ', 'Х'
        ];
        $lat = [
            'ch', 'sh', 'sh', 'ya', 'ts', 'yo', "g'", 'yu', "o'", 'a', 'b', 'v', 'g', 'd', 'e', 'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p',
            'r', 's', 't', 'u', 'f', 'h', 'a', 'i', 'y', 'e', 'j', 'q', 'x',
            'Ch', 'Sh', 'Sh', 'Ya', 'Ts', 'Yo', "G'", 'Yu', "O'", 'A', 'B', 'V', 'G', 'D', 'E', 'Z', 'I', 'Y', 'K', 'L', 'M', 'N', 'O', 'P',
            'R', 'S', 'T', 'U', 'F', 'H', 'A', 'I', 'Y', 'e', 'J', 'Q', 'X'
        ];
        return str_replace($cyr, $lat, $cyrillicString);
    }
}
