<?php

return [
    'phone_blocked' => 'Ваш номер телефона заблокирован. Пожалуйста,повторите попытку через :time',
    'confirmation_sent' => 'Подтверждение по смс отправлено на :attribute',
    'invalid_code' => 'Код подтверждения недействителен.',
    'too_many_attempts' => 'Слишком много попыток. Пожалуйста, используйте повторную отправку SMS',
    'сode_expired' => 'Действие кода истекло . Пожалуйста, используйте повторную отправку SMS',
    'minutes_diff' => ':minutes мин :seconds сек',
];
